ДипломДоп/src/Documents/ВКМ_ВходящийHTTPЗапрос/ВКМ_ВходящийHTTPЗапрос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВходящийHTTPЗапрос</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТелоЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ДипломДоп/src/CommonModules/ВКМ_ОбщегоНазначенияHTTP/Module.bsl
#Область ПрограмныйИнтерфейс

Функция СтрокаJSON(ОбъектJSON) Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись,ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ОбъектJSON(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;
	
КонецФункции  

Функция ОтветJSON(Объект, КодСостояния = 200) Экспорт

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type",ТипКонтентаJSON());
	
	Возврат Ответ ;
	
КонецФункции

Функция ПростойУспешныйОтвет() Экспорт

    Результат = Новый Структура;
	Результат.Вставить("Result","OK");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции 

Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт

    ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
                              ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
    Результат = Новый Структура;
	Результат.Вставить("Result","Error");                          
	Результат.Вставить("ErrorText",КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Возврат ОтветJSON(Результат, 500);
	
КонецФункции

Процедура ЗаписьЛога(ИмяМетода,Запрос,Ответ) Экспорт

   ДокОбъект = Документы.ВКМ_ВходящийHTTPЗапрос.СоздатьДокумент();
   ДокОбъект.ИмяМетода = ИмяМетода;
   ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
   Попытка
   	  ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));
   Исключение
   КонецПопытки;
   
   ДокОбъект.ТелоЗапроса = ТелоЗапроса;
   ДокОбъект.КодСостояния = Ответ.КодСостояния; 
   ДокОбъект.Дата = ТекущаяДатаСеанса();
   
   ДокОбъект.Записать();   	
   
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипКонтентаJSON() 		
	Возврат "application/json" ;	
КонецФункции 

#КонецОбласти
